dataset_gen/Earlier_Datasets/NS_Sines_openfoam2/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
16384
(
(0.08303850183673615 0.30894008117452143 0.0)
(-0.03711300850061393 0.19698284340418365 0.0)
(-0.1634114110980691 0.09142926818749855 0.0)
(-0.2796052212268975 0.002774538456769733 0.0)
(-0.37004350203875686 -0.06200876766600931 0.0)
(-0.42207528307843095 -0.10025956449324278 0.0)
(-0.42801799360305787 -0.11379422385710351 0.0)
(-0.3863826770956035 -0.10843760453784441 0.0)
...
);

boundaryField
{
    left
    {
        type cyclic;
    }
    right
    {
        type cyclic;
    }
    bottom
    {
        type cyclic;
    }
    top
    {
        type cyclic;
    }
    frontAndBack
    {
        type empty;
    }
}
